#pragma once

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// ⚙️ Подключение библиотек/модулей
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// Подключаем библиотеку для настройки консоли с выводом (корректное отображение кириллицы)
#include <locale.h>
#include <windows.h>

// Подключаем библиотеку для работы со строками, их вводом и выводом
#include <iostream>

// Подключаем библиотеку для работы с метаматическими функциями
#include <cmath>



// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// ⚙️ Подключение библиотек/модулей
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// Подключаем файл заголовков со всеми доступными методами нашей программы
#include "method_prototypes.h"