#pragma once

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 🎨 Прототипы методов для запуска интерфейса
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// Метод запускает основной интерфейс программы
bool user_interface_start_main();

// Метод выводящий в консоль подробный список доступных для решения задач
void user_interface_show_task();

// Метод запускает интерфейс для решения 1-го задания из лабораторной работы
void user_interface_start_task_1();

// Метод запускает интерфейс для решения 2-го задания из лабораторной работы
void user_interface_start_task_2();

// Метод запускает интерфейс для решения 3-го задания из лабораторной работы
void user_interface_start_task_3();

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 🎨 Прототипы методов для решения 1-го задания лаборатоной работы
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 🎨 Прототипы методов для решения 2-го задания лаборатоной работы
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 🎨 Прототипы методов для решения 3-го задания лаборатоной работы
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -


// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 🎨 Прототипы вспомогательных (services) методов для реализации интерфейса
// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// Метод для создания строки с отступами, после которого необходимо очищать память
char* create_string_of_spaces(int count_of_spaces);

// Метод для отображения текста с переданным количеством отступов, после которого автоматически очищается память
void print_with_indent(int count_of_spaces, const char* text);