#include "connected_libraries.h"

void user_interface_show_task() 
{
	// Заголовок для вывода описания заданий
	print_with_indent(0, "Список доступных для решения заданий:");

	// Описание для задания 1-го задания
	print_with_indent(4, "Задание №1. В одномерном массиве, состоящем из n вещественных элементов, вычислить:");
	print_with_indent(8, "1.1. Количество и координаты элементов массива, больших C;");
	print_with_indent(8, "1.2. Произведение элементов массива, расположенных после максимального по модулю элемента. Определить значение максимального по модулю элемента и его координату. Если в массиве несколько максимумов, то пользователь выбирает после какого из них нужно вычислить произведение;");
	print_with_indent(8, "1.3. Преобразовать массив таким образом, чтобы, чтобы сначала располагались все отрицательные элементы, а потом все положительные (элементы, равные нулю, считать положительными) и описать алгоритм.");

	// Описание для задания 2-го задания
	print_with_indent(4, "Задание №2. В целочисленной прямоугольной матрице размером строк N на столбцов M");
	print_with_indent(8, "2.1. Определить номер первого из столбцов, содержащих хотя бы один нулевой элемент. Вывести найденный столбец вместе с его координатой;");
	print_with_indent(8, "2.2. Характеристикой строки целочисленной матрицы назовём сумму её отрицательных чётных элементов. Переставляя строки заданной матрицы, расположить их в соответствии с убыванием характеристик. Вывести исходную матрицу и матрицу после преобразования, каждую с их характеристиками.");

	// Описание для задания 3-го задания
	print_with_indent(4, "Задание №3");
	print_with_indent(8, "3.1. Написать программу, которая считывает текст из файла, находит самое длинное слово и определяет, сколько раз оно встретилось в тексте");

	return;
}

// Функция для вызова пользовательского интерфейса в бесконечном цикле `while [значение]`
// Функция проводит прос 
bool user_interface_start_main()
{
	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// Значения отслеживания состояния программы
	char user_select_task;
	char user_select_subtask;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// Пользовательский выбор номера задания
	std::cout << std::endl << "Введите номер задания, решение которого будет запущено ( 1 / 2 / 3 )";
	std::cout << std::endl << "Для выхода из приложения введите 0";
	std::cout << std::endl << "Ввод: ";
	std::cin >> user_select_task;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
	// Проверка полученного от пользователя значения и вызов метода с выбором подзадачи, если это необходимо
	switch (user_select_task)
	{
		case '0':
			return true;

		case '1':
			std::cout << std::endl << "Введите номер подзадачи, решение которой будет запущено ( 1 / 2 / 3 )";
			print_with_indent(8, "1.1. Количество и координаты элементов массива, больших C;");
			print_with_indent(8, "1.2. Произведение элементов массива, расположенных после максимального по модулю элемента. Определить значение максимального по модулю элемента и его координату. Если в массиве несколько максимумов, то пользователь выбирает после какого из них нужно вычислить произведение;");
			print_with_indent(8, "1.3. Преобразовать массив таким образом, чтобы, чтобы сначала располагались все отрицательные элементы, а потом все положительные (элементы, равные нулю, считать положительными) и описать алгоритм.");
			std::cout << std::endl << "Ввод: ";
			std::cin >> user_select_subtask;
			return false;

		case '2':
			std::cout << std::endl << "Введите номер подзадачи, решение которой будет запущено ( 1 / 2 )";
			print_with_indent(8, "2.1. Определить номер первого из столбцов, содержащих хотя бы один нулевой элемент. Вывести найденный столбец вместе с его координатой;");
			print_with_indent(8, "2.2. Характеристикой строки целочисленной матрицы назовём сумму её отрицательных чётных элементов. Переставляя строки заданной матрицы, расположить их в соответствии с убыванием характеристик. Вывести исходную матрицу и матрицу после преобразования, каждую с их характеристиками.");
			std::cout << std::endl << "Ввод: ";
			std::cin >> user_select_subtask;
			return false;

		case '3':
			user_select_subtask = 0;
			return false;

		default:
			return false;
	}

	return false;
}

void user_interface_start_task_1(char user_selection)
{
	switch (user_selection)
	{
		case '1':
			break;

		case '2':
			break;

		case '3':
			break;
	}

	return;
}

void user_interface_start_task_2(char user_selection)
{

}

void user_interface_start_task_3(char user_selection)
{

}